#########################################################################################
name_date = 'Leo Tolstoy*1828-08-28*1910-11-20'
### Выводим из строки str
separation = name_date.split('*')
name = separation[0]
### Разбиваем даты рождения и смерти
date_1 = separation[1]
date_of_birth = date_1.split('-')
date_2 = separation[2]
date_of_death = date_2.split('-')
print(name, 'умер в возрасте:', int(date_of_death[0]) - int(date_of_birth[0]), 'лет')
#########################################################################################
###  Надеюсь такой вариант считается выполненным)